szf2020/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
                    Serial.println("DS18B20 sensors configuration loaded! Dat Pin is " + String(datPin) + ", Resolution: " + String(resolution) +
                                   ", Transmission interval: " + String(transmissionInterval));
                }
#endif // USE_DS18B20

#ifdef USE_HW507
                if (deviceType == "HW507")
                {
                    uint8_t dataPin    = arrPins[0]["MicrocontrollerGpoPin"];
                    u16_t   intervalMs = 10000;
                    uint8_t deviceType = DHT11;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName = property["Name"];

                        if (propertyName == "DeviceType")
                        {
                            deviceType == property["Value"];
                        }
                        else if (propertyName == "IntervalMs")
                        {
                            intervalMs == property["Value"];
                        }
                    }
                    hw507HumiditySensor = new IotZoo::HW507(deviceIndex, settings, mqttClient, getBaseTopic(), deviceType, dataPin, intervalMs);
                }
#endif // USE_HW507

#ifdef USE_WS2818
                if (deviceType == "NEO")
                {
                    Serial.println("Configuration of NEO pixels...");
                    int dioPin       = arrPins[0]["MicrocontrollerGpoPin"];
                    int numberOfLeds = 256;

                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];
                        if (propertyName == "numberOfLeds")
                        {
                            numberOfLeds = std::stoi(propertyValue.c_str());
                        }
                    }
                    ws2812 = new WS2818(deviceIndex, settings, mqttClient, getBaseTopic(), dioPin, numberOfLeds);
                    Serial.println("Neo pixel configuration loaded! DIO Pin is " + String(dioPin) + ", Leds: " + String(numberOfLeds));
                }
#ifdef USE_WS2818_PIXEL_MATRIX
                else if (deviceType == "PixelMatrix")
                {
                    Serial.println("Configuration of NEO pixel matrix...");
                    int  dioPin                = arrPins[0]["MicrocontrollerGpoPin"];
                    uint numberOfLedsPerColumn = 8;
                    uint numberOfLedsPerRow    = 8;
                    uint extensions            = 0;

                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];
                        if (propertyName == "numberOfLedsPerColumn")
                        {
                            numberOfLedsPerColumn = std::stoi(propertyValue.c_str());
                        }
                        else if (propertyName == "numberOfLedsPerRow")
                        {
                            numberOfLedsPerRow = std::stoi(propertyValue.c_str());
                        }
                        else if (propertyName == "extensions")
                        {
                            extensions = std::stoi(propertyValue.c_str());
                        }
                        extensions = 1;
                    }
                    ws2812 = new PixelMatrix(deviceIndex, settings, mqttClient, getBaseTopic(), dioPin, numberOfLedsPerColumn, numberOfLedsPerRow,
                                             (PixelMatrixExtensions)extensions);
                    Serial.println("Neo pixel matrix configuration loaded! DIO Pin is " + String(dioPin) +
                                   ", numberOfLedsPerColumn: " + String(numberOfLedsPerColumn) +
                                   ", numberOfLedsPerRow: " + String(numberOfLedsPerRow) + ", Extensions: " + String(extensions));
                }
#endif // USE_WS2818_PIXEL_MATRIX
#endif // USE_WS2818

#ifdef USE_TM1637_4
                if (deviceType == "TM1637_4")
                {
                    Serial.println("TM1637_4 display");

                    int clkPin = arrPins[0]["MicrocontrollerGpoPin"];
                    int dioPin = arrPins[1]["MicrocontrollerGpoPin"];

                    bool   flipDisplay = false;
                    String serverDownText;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];

                        if (propertyName == "flipDisplay")
                        {
                            propertyValue.toLowerCase();
                            flipDisplay = propertyValue == "true";
                        }
                        else if (propertyName == "serverDownText")
                        {
                            propertyValue.toLowerCase();
                            serverDownText = propertyValue;
                        }
                    }
                    tm1637_4Handling = new TM1637_4_Handling();
                    if (nullptr != tm1637_4Handling)
                    {
                        tm1637_4Handling->addDevice(getBaseTopic(), deviceIndex, clkPin, dioPin, flipDisplay, serverDownText);
                        Serial.println("TM1637_4 display with deviceIndex " + String(deviceIndex) + " initialized! CLK Pin is " + String(clkPin) +
                                       ", DIO Pin is " + String(dioPin) + ", FlipDisplay: " + String(flipDisplay));
                    }
                }
#endif // USE_TM1637_4

#ifdef USE_TM1637_6
                if (deviceType == "TM1637_6")
                {
                    Serial.println("TM1637_6 display");

                    int clkPin = arrPins[0]["MicrocontrollerGpoPin"];
                    int dioPin = arrPins[1]["MicrocontrollerGpoPin"];

                    bool   flipDisplay = false;
                    String serverDownText;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];

