szf2020/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
                // Hochrechnen auf 10000 Impulse = 1000 Watt pro Stunde
                double watt = 360000.0 / diff;
                Serial.println(String(watt) + " watt");
#ifdef USE_OLED_SSD1306
                if (nullptr != oled1306)
                {
                    oled1306->setTextLine(1, String(watt, 0));
                }
#endif
                String topic = getBaseTopic() + "/power/0";
                mqttClient->publish(topic, String(watt, 0));
                lastMillisInfrared = millis();
            }
        }
        digitalValueOldInfrared = digitalValueInfrared;
#endif

#ifdef USE_KEYPAD
        buttonMatrixHandling.loop();
#endif

#ifdef USE_HC_SR501
        motionDetectorsHrsc501Handling.loop();
#endif

#ifdef USE_RD_03D
        if (nullptr != rd03d)
        {
            rd03d->loop();
        }
#endif // USE_RD_03D

#if defined(USE_MQTT) || defined(USE_MQTT2) && !defined(USE_BLE_HEART_RATE_SENSOR)
        try
        {
            if (millis() - lastAliveTime > settings->getAliveIntervalMillis())
            {
                publishAliveMessage();
            }
        }
        catch (const std::exception& e)
        {
            Serial.println(e.what()); // Exception handling does only work with build_flags -DPIO_FRAMEWORK_ARDUINO_ENABLE_EXCEPTIONS
        }
#endif // USE_HC_SR501

        loopDurationMs = millis() - lastLoopStartTime;

        if (millis() - lastServerAliveMillis > (settings->getAliveIntervalMillis() * 2))
        {
            onIotZooClientUnavailable();
            lastServerAliveMillis = millis();
        }

        if (loopDurationMs < 100)
        {
            delay(100 - loopDurationMs);
        }
        digitalWrite(LED_BUILTIN, LOW); // turn the LED off to indicate that the device is offline.
    }
    catch (const std::exception& e)
    {
        publishError(e.what());
        delay(1000);
    }
}

// --- end of main.cpp
